Revit 2025 API
StairsEndConnectionType Enumeration
 The join style between a run and landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StairsEndConnectionType
Public Enumeration StairsEndConnectionType
public enum class StairsEndConnectionType
type StairsEndConnectionType
Members
Member name | Value | Description
StraightCut | 0 |  The run and landing are joined by a straight cut.
Notch | 1 |  The run and landing are joined by a notch.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace